app/controllers/profile_controller.rb

SELECT "vsms".* FROM "vsms"
SELECT "sipocs".* FROM "sipocs"
---
	def index
		@vsm = Vsm.all
		@sipoc = Sipoc.all