app/controllers/sipocs_controller.rb

SELECT  "sipocs".* FROM "sipocs" WHERE "sipocs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @sipoc = Sipoc.find(params[:id])

SELECT  "sipocs".* FROM "sipocs" WHERE "sipocs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "sipocs" ("file_name", "supplier1", "input1", "process_requirement1", "process1", "output1", "customer_requirement1", "customer1", "supplier2", "input2", "process_requirement2", "process2", "output2", "customer_requirement2", "customer2", "supplier3", "input3", "process_requirement3", "process3", "output3", "customer_requirement3", "customer3", "supplier4", "input4", "process_requirement4", "process4", "output4", "customer_requirement4", "customer4", "supplier5", "input5", "process_requirement5", "process5", "output5", "customer_requirement5", "customer5", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39) RETURNING "id"
---
  def create
    @sipoc = Sipoc.new(sipoc_params)
    @sipoc.user = User.find(1)

    if @sipoc.save

DELETE FROM "sipocs" WHERE "sipocs"."id" = $1  [["id", 2]]
---
  def destroy
    @sipoc.destroy

SELECT  "sipocs".* FROM "sipocs" WHERE "sipocs"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def set_sipoc
      @sipoc = Sipoc.find(params[:id])