app/controllers/vsms_controller.rb

SELECT  "vsms".* FROM "vsms" WHERE "vsms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def show
		@vsm = Vsm.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "vsms" ("file_name", "inventory1", "processA", "resourceA", "dataA1", "dataA2", "dataA3", "inventory2", "processB", "resourceB", "dataB1", "dataB2", "dataB3", "inventory3", "processC", "resourceC", "dataC1", "dataC2", "dataC3", "inventory4", "processD", "resourceD", "dataD1", "dataD2", "dataD3", "PLT1", "PLT2", "PLT3", "PLT4", "PT1", "PT2", "PT3", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35) RETURNING "id"
---
	def create
		@vsm = Vsm.new(vsm_params)
		@vsm.user = User.find(1)

		if @vsm.save

SELECT  "vsms".* FROM "vsms" WHERE "vsms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@vsm = Vsm.find(params[:id])

SELECT  "vsms".* FROM "vsms" WHERE "vsms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "vsms" SET "resourceD" = $1, "updated_at" = $2 WHERE "vsms"."id" = $3  [["resourceD", "Saturdays!"], ["updated_at", "2019-05-03 05:25:37.899908"], ["id", 1]]
---
	def update
		@vsm = Vsm.find(params[:id])
		if @vsm.update(vsm_params)

SELECT  "vsms".* FROM "vsms" WHERE "vsms"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "vsms" WHERE "vsms"."id" = $1  [["id", 2]]
---
	def destroy
		@vsm = Vsm.find(params[:id])
  		@vsm.destroy